import board1 from '@/assets/images/learn/board-learn-1.png';
import board2 from '@/assets/images/learn/board-learn-2.png';
import board3 from '@/assets/images/learn/board-learn-3.png';
import board4 from '@/assets/images/learn/board-learn-4.png';
import board5 from '@/assets/images/learn/board-learn-5.png';
import board6 from '@/assets/images/learn/board-learn-6.png';

export const learnData = [
  {
    key: 'beginner',
    title: 'مبتدی',
    subcategories: [
      {
        key: 'intro',
        title: 'آشنایی با تخته نرد',
        pages: [
          {
            id: 1,
            title: 'درس 1',
            components: [
              {
                type: 'hero',
                title: '',
              },
              {
                type: 'content',
                value: `تخته نرد یک مسابقه برای رسیدن به انتهاست. از تاس‌هایتان برای حرکت دادن تمام مهره‌هایتان در صفحه استفاده کنید و اولین نفری باشید که همه را از صفحه خارج می‌کند.`,
              },
              {
                type: 'image',
                src: board1,
                alt: '',
              },
              {
                type: 'quiz',
                question: 'چه کسی برنده بازی می‌شود؟',
                options: ['اولین نفری که همه مهره‌هایش را از صفحه خارج کند', 'آخرین نفری که همه مهره‌هایش را از صفحه خارج کند.'],
                correctAnswer: 0,
              },
            ],
          },
          {
            id: 2,
            title: 'درس 2',
            components: [
              {
                type: 'hero',
                title: 'شماره گذاری خانه ها',
              },
              {
                type: 'content',
                value: `در تخته نرد برای مشخص کردن خانه ها آنها را شماره گذاری میکنیم.`,
              },
              {
                type: 'image',
                src: board1,
                alt: '',
              },
              {
                type: 'quiz',
                question: 'در خانه شماره ۸ چند مهره وجود دارد؟',
                options: ['سه مهره سفید', 'دو مهره سیاه'],
                correctAnswer: 0,
              },
            ],
          },
          {
            id: 3,
            title: 'درس 3',
            components: [
              {
                type: 'hero',
                title: 'چیدمان مهره‌ها',
              },
              {
                type: 'content',
                value: `در تخته نرد، شما مهره‌های خود را از خانه ۲۴ به سمت خانه ۱ در اطراف صفحه حرکت می‌دهید و حریفتان در جهت مخالف شما حرکت میدهد.`,
              },
              {
                type: 'image',
                src: board2,
                alt: '',
              },
              {
                type: 'quiz',
                question: 'جهت حرکت حریفتان به کدام سمت است؟',
                options: ['از خانه ۲۴ به ۱', 'از خانه ۱ به ۲۴'],
                correctAnswer: 1,
              },
            ],
          },
          {
            id: 4,
            title: 'درس 4',
            components: [
              {
                type: 'hero',
                title: 'جفت تاس',
              },
              {
                type: 'content',
                value: `وقتی هر دو تاس روی یک عدد قرار بگیرند، به آن «جفت تاس» می‌گویند. این کار تعداد حرکات شما را در مقایسه با یک پرتاب معمولی، دو برابر می‌کند. برای مثال، اگر دو عدد ۳ بیاورید، به جای دو بار، می‌توانید چهار بار حرکت ۳ را انجام دهید.`,
              },
              {
                type: 'image',
                src: board3,
                alt: 'عکس',
              },
              {
                type: 'quiz',
                question: 'دو تاس ۱ (جفت یک) به چه معناست؟',
                options: ['دو بار حرکت به اندازه ۱', 'چهار بار حرکت به اندازه ۱'],
                correctAnswer: 1,
              },
            ],
          },
          {
            id: 5,
            title: 'درس 5',
            components: [
              {
                type: 'hero',
                title: 'نحوه زدن حریف',
              },
              {
                type: 'content',
                value: `در بازی تخته‌نرد، اگر حریفتان مهرهٔ تنها (تک) در خانه‌ای داشته باشد، می‌توانید با آوردن یکی از مهره‌های خود دقیقاً روی آن خانه، ضربه بزنید و مهرهٔ او را به بیرون از تخته بفرستید. اما توجه داشته باشید که نمی‌توانید به خانه‌های بسته‌ای ضربه بزنید که دو یا چند مهره از حریف روی آنها قرار دارد.`,
              },
              {
                type: 'image',
                src: board4,
              },
              {
                type: 'quiz',
                question: 'به عنوان بازیکن سفید به مهره کدام خانه میتوانید ضربه بزنید؟',
                options: ['خانه 22', 'خانه 21', 'خانه 20', 'خانه 19'],
                correctAnswer: 2,
              },
            ],
          },
          {
            id: 6,
            title: 'درس 6',
            components: [
              {
                type: 'hero',
                title: 'برگشتن به صفحه',
              },
              {
                type: 'content',
                value: `وقتی مهره‌هایتان ضربه خورد و بیرون رفت، برای برگرداندنشان به صفحه باید تاس بیندازید و طبق تاس مهره را در خانه اش وارد کنید. اگر خانه بسته باشد (یعنی دو یا چند مهره حریف در آن باشد)، نمی‌توانید در آن بنشینید و نوبتتان می‌سوزد.
                `,
              },
              {
                type: 'image',
                src: board5,
              },
              {
                type: 'quiz',
                question: 'بازیکن سیاه با چه تاس هایی میتواند در صفحه بنشید؟',
                options: ['2 و 5', '1 و 3', '1 و 4', '4 و 6'],
                correctAnswer: 2,
              },
            ],
          },
          {
            id: 7,
            title: 'درس 7',
            components: [
              {
                type: 'hero',
                title: 'خارج کردن مهره ها',
              },
              {
                type: 'content',
                value: `برای خارج کردن مهره در تخته نرد، ابتدا باید تمام مهره های خودتان را وارد خانه خود کنید. سپس میتوانید مهره هاتان را از تخته خارج کنید و برنده شوید. هر بازیکنی که زودتر تمام مهره هایش را خارج کند برنده میشود.`,
              },
              {
                type: 'image',
                src: board6,
                alt: 'عکس',
              },
              {
                type: 'quiz',
                question: 'بازیکن سفید میتواند مهره هایش را از تخته خارج کند؟',
                options: [ 'بله میتواند', 'نه نمیتواند'],
                correctAnswer: 1,
              },
            ],
          },
        ],
      },
      /*
      {
        key: 'basii',
        title: 'آشنایی با بازی نردلند',
        pages: [
          {
            id: 1,
            title: 'حرکت مهره‌ها',
            components: [
              {
                type: 'hero',
                title: 'حرکت مهره‌ها',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
          {
            id: 2,
            title: 'قواعد تاس انداختن',
            components: [
              {
                type: 'hero',
                title: 'قواعد تاس انداختن',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
        ],
      },
      {
        key: 'basics',
        title: 'آموزش گشایش ها',
        pages: [
          {
            id: 1,
            title: 'حرکت مهره‌ها',
            components: [
              {
                type: 'hero',
                title: 'حرکت مهره‌ها',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
          {
            id: 2,
            title: 'قواعد تاس انداختن',
            components: [
              {
                type: 'hero',
                title: 'قواعد تاس انداختن',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.
                `,
              },
            ],
          },
        ],
      },
      {
        key: 'basi',
        title: 'استراتژی های تخته نرد',
        pages: [
          {
            id: 1,
            title: 'حرکت مهره‌ها',
            components: [
              {
                type: 'hero',
                title: 'حرکت مهره‌ها',
              },
              {
                type: 'content',
                value: `
                تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
          {
            id: 2,
            title: 'قواعد تاس انداختن',
            components: [
              {
                type: 'hero',
                title: 'قواعد تاس انداختن',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
        ],
      }, */
    ],
  },
];