import def from '@/assets/avatar/default.jpeg';
import board1 from '@/assets/images/learn/board-learn-1.png';

export const learnData = [
  {
    key: 'beginner',
    title: 'مبتدی',
    subcategories: [
      {
        key: 'intro',
        title: 'آشنایی با تخته نرد',
        pages: [
          {
            id: 1,
            title: 'درس 1',
            components: [
              {
                type: 'hero',
                title: '',
              },
              {
                type: 'content',
                value: `تخته نرد یک مسابقه برای رسیدن به انتهاست. از تاس‌هایتان برای حرکت دادن تمام مهره‌هایتان در صفحه استفاده کنید و اولین نفری باشید که همه را از صفحه خارج می‌کند.`,
              },
              {
                type: 'image',
                src: board1,
                alt: '',
              },
              {
                type: 'quiz',
                question: 'چه کسی برنده بازی می‌شود؟',
                options: ['اولین نفری که همه مهره‌هایش را از صفحه خارج کند', 'آخرین نفری که همه مهره‌هایش را از صفحه خارج کند.'],
                correctAnswer: 0,
              },
            ],
          },
          {
            id: 2,
            title: 'درس 2',
            components: [
              {
                type: 'hero',
                title: 'شماره گذاری خانه ها',
              },
              {
                type: 'content',
                value: `در تخته نرد برای مشخص کردن خانه ها آنها را شماره گذاری میکنیم.`,
              },
              {
                type: 'image',
                src: board1,
                alt: '',
              },
              {
                type: 'quiz',
                question: 'در خانه شماره ۸ چند مهره وجود دارد؟',
                options: ['سه مهره سفید', 'دو مهره سیاه'],
                correctAnswer: 0,
              },
            ],
          },
          {
            id: 3,
            title: 'درس 3',
            components: [
              {
                type: 'hero',
                title: 'چیدمان مهره‌ها',
              },
              {
                type: 'content',
                value: `در تخته نرد، شما مهره‌های خود را از خانه ۲۴ به سمت خانه ۱ در اطراف صفحه حرکت می‌دهید و حریف شما مخالف در جهت شما حرکت میدهد.`,
              },
              {
                type: 'image',
                src: def,
                alt: 'عکس',
              },
              {
                type: 'quiz',
                question: 'جهت حرکت حریفتان به کدام سمت است؟',
                options: [ 'از خانه ۲۴ به ۱', 'از خانه ۱ به ۲۴'],
                correctAnswer: 1,
              },
            ],
          },
          {
            id: 4,
            title: 'درس 3',
            components: [
              {
                type: 'hero',
                title: 'چیدمان مهره‌ها',
              },
              {
                type: 'content',
                value: `وقتی هر دو تاس روی یک عدد قرار بگیرند، به آن «جفت تاس» می‌گویند. این کار تعداد حرکات شما را در مقایسه با یک پرتاب معمولی، دو برابر می‌کند. برای مثال، اگر دو عدد ۳ بیاورید، به جای دو بار، می‌توانید چهار بار حرکت ۳ را انجام دهید.`,
              },
              {
                type: 'image',
                src: def,
                alt: 'عکس',
              },
              {
                type: 'quiz',
                question: 'دو تاس ۱ (جفت یک) به چه معناست؟',
                options: ['دو بار حرکت به اندازه ۱', 'چهار بار حرکت به اندازه ۱'],
                correctAnswer: 1,
              },
            ],
          },
        ],
      },
      {
        key: 'basii',
        title: 'آشنایی با بازی نردلند',
        pages: [
          {
            id: 1,
            title: 'حرکت مهره‌ها',
            components: [
              {
                type: 'hero',
                title: 'حرکت مهره‌ها',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
          {
            id: 2,
            title: 'قواعد تاس انداختن',
            components: [
              {
                type: 'hero',
                title: 'قواعد تاس انداختن',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
        ],
      },
      {
        key: 'basics',
        title: 'آموزش گشایش ها',
        pages: [
          {
            id: 1,
            title: 'حرکت مهره‌ها',
            components: [
              {
                type: 'hero',
                title: 'حرکت مهره‌ها',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
          {
            id: 2,
            title: 'قواعد تاس انداختن',
            components: [
              {
                type: 'hero',
                title: 'قواعد تاس انداختن',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.
                `,
              },
            ],
          },
        ],
      },
      {
        key: 'basi',
        title: 'استراتژی های تخته نرد',
        pages: [
          {
            id: 1,
            title: 'حرکت مهره‌ها',
            components: [
              {
                type: 'hero',
                title: 'حرکت مهره‌ها',
              },
              {
                type: 'content',
                value: `
                تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
          {
            id: 2,
            title: 'قواعد تاس انداختن',
            components: [
              {
                type: 'hero',
                title: 'قواعد تاس انداختن',
              },
              {
                type: 'content',
                value: `
تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است. بخش اول تاریخچه تخته نرد این یک متن ساده درباره تاریخچه است.

مورد اول مورد دوم این یک نکته مهم است
                `,
              },
            ],
          },
        ],
      },
    ],
  },
];